a = int(input('Введите длину стороны a: '))
b = int(input('Введите длину стороны b: '))
c = int(input('Введите длину стороны c: '))

if a > (b + c) or b > (a + c) or c > (a + b):
   print(f'Треугольник со сторонами a = {a}, b = {b}, c = {c} не существует')
else:
  if a == b == c:
    print(f'Треугольник со сторонами a = {a}, b = {b}, c = {c} - Равносторонний')
  
  elif a != b and a != c and b != c:
    print(f'Треугольник со сторонами a = {a}, b = {b}, c = {c} - Разносторонний')
    
  else:
    print(f'Треугольник со сторонами a = {a}, b = {b}, c = {c} - Равнобедренный')
